import { EquipmentType } from "../../types/type";

const equipments: EquipmentType[] = [
  {
    type_equip: "PC",
    price: 64000,
    pathimg: "IRU_510B6GMA",
    short_info: {
      Процессор: "Intel Core i5-12400F 2.5 ГГц",
      "Оперативная память": "16 ГБ, DDR4, DIMM, 3200 МГц",
      Диски: "SSD 1024 ГБ",
      Графика: "NVIDIA GeForce GTX 1650 - 4 ГБ",
      "Операционная система": "Free DOS",
    },
    main_info: {
      Бренд: "IRU",
      Модель: "510B6GMA",
      Процессор: {
        "Сокет процессора": "LGA 1700",
        Процессор: "Intel Core i5 12400F",
        "Процессор, частота": "2.5 ГГц (4.4 ГГц, в режиме Turbo)",
        "Количество ядер процессора": "6-ядерный",
        "Чипсет материнской платы": "Intel B560",
      },
      "Оперативная память": {
        "Оперативная память": "16 ГБ, DDR4, DIMM, 3200 МГц",
        "Максимальный объем оперативной памяти": "64 ГБ",
      },
      "Графический адаптер": {
        "Тип графического контроллера": "дискретный",
        Графика: "NVIDIA GeForce GTX 1650 - 4 ГБ",
      },
      "Хранение информации": {
        Объем: "SSD 1024 ГБ",
      },
      "Программное обеспечение": {
        "Операционная система": "Free DOS",
      },
      Корпус: {
        "Тип корпуса": "miditower",
        "Блок питания": "500 Вт",
        "Цвет корпуса": "черный",
        "Размеры корпуса": "(ШхВхГ) 210 х 459 х 403 мм",
        "Вес товара": "7 кг",
      },
      Гарантия: "36 мес",
    },
    description: {
      description:
        "Практичный компьютер IRU Game 510B6GMA создан, чтобы решать любые геймерские задачи. За высокую производительность отвечает процессор Intel Core i5 12400F. При обычной работе его частота равна  2,5 ГГц, а при активации режима Turbo достигает   4,4 ГГц. Используется чипсет материнской платы Intel B660.",
    },
  },

  {
    type_equip: "PC",
    price: 74000,
    pathimg: "ACER_TC-3060",
    short_info: {
      Процессор: "Intel Core i5 12600, 3.3 ГГц",
      "Оперативная память": "16 ГБ, DDR4, DIMM, 3200 МГц",
      Диски: "SSD 512 ГБ",
      Графика: "NVIDIA GeForce RTX 3060 - 12 ГБ",
      "Операционная система": "Free DOS",
    },
    main_info: {
      Бренд: "ACER",
      Модель: "TC-3060",
      Процессор: {
        "Сокет процессора": "LGA 1700",
        Процессор: "Intel Core i5 12600, 3.3 ГГц",
        "Процессор, частота": "3.3 ГГц (4.8 ГГц, в режиме Turbo)",
        "Количество ядер процессора": "6-ядерный",
        "Чипсет материнской платы": "Intel B560",
      },
      "Оперативная память": {
        "Оперативная память": "16 ГБ, DDR4, DIMM, 3200 МГц",
        "Максимальный объем оперативной памяти": "64 ГБ",
      },
      "Графический адаптер": {
        "Тип графического контроллера": "дискретный",
        Графика: "NVIDIA GeForce RTX 3060 - 12 ГБ",
      },
      "Хранение информации": { Объем: "SSD 512 ГБ" },
      "Программное обеспечение": { "Операционная система": "Free DOS" },
      Корпус: {
        "Тип корпуса": "miditower",
        "Блок питания": "700 Вт",
        "Цвет корпуса": "черный",
        "Размеры корпуса": "(ШхВхГ) 210 х 459 х 403 мм",
        "Вес товара": "8 кг",
      },
      Гарантия: "36 мес",
    },
    description: {
      description:
        "Практичный компьютер ACER TC-3060 создан, чтобы решать любые геймерские задачи. За высокую производительность отвечает процессор Intel Core i5 12600. При обычной работе его частота равна 3.3 ГГц, а при активации режима Turbo достигает 4.8 ГГц. Используется чипсет материнской платы Intel B660.",
    },
  },

  {
    type_equip: "PC",
    price: 84000,
    pathimg: "MSI_Trident_AS",
    short_info: {
      Процессор: "Intel Core i5-13400F 2.5 ГГц",
      "Оперативная память": "16 ГБ, DDR4, DIMM, 3200 МГц",
      Диски: "SSD 512 ГБ",
      Графика: "NVIDIA GeForce RTX 3070 - 8 ГБ",
      "Операционная система": "Free DOS",
    },
    main_info: {
      Бренд: "MSI",
      Модель: "Trident AS",
      Процессор: {
        "Сокет процессора": "LGA 1700",
        Процессор: "Intel Core i5-13400F 2.5 ГГц",
        "Процессор, частота": "2.5 ГГц (4.6 ГГц, в режиме Turbo)",
        "Количество ядер процессора": "10-ядерный",
        "Чипсет материнской платы": "Intel H610",
      },
      "Оперативная память": {
        "Оперативная память": "16 ГБ, DDR4, DIMM, 3200 МГц",
        "Максимальный объем оперативной памяти": "64 ГБ",
      },
      "Графический адаптер": {
        "Тип графического контроллера": "дискретный",
        Графика: "NVIDIA GeForce RTX 3070 - 8 ГБ",
      },
      "Хранение информации": { Объем: "SSD 512 ГБ" },
      "Программное обеспечение": { "Операционная система": "Windows  10 Home" },
      Корпус: {
        "Тип корпуса": "miditower",
        "Блок питания": "900 Вт",
        "Цвет корпуса": "черный",
        "Размеры корпуса": "(ШхВхГ) 210 х 459 х 403 мм",
        "Вес товара": "8.5 кг",
      },
      Гарантия: "36 мес",
    },
    description: {
      description:
        "Практичный компьютер MSI Trident AS создан, чтобы решать любые геймерские задачи. За высокую производительность отвечает процессор Intel Core i5-13400F. При обычной работе его частота равна 2.5 ГГц, а при активации режима Turbo достигает 4.6 ГГц. Используется чипсет материнской платы Intel H610.",
    },
  },

  {
    type_equip: "keyboards",
    price: 3639,
    pathimg: "OKLICK_K953X",
    short_info: {
      "Тип соединения": "проводная",
      Интерфейс: "USB",
      "Длина кабеля": "1.5 м",
      "Тип механических переключателей": "GTMX Brown",
      Конструктив: "механическая",
    },
    main_info: {
      Бренд: "OKLICK",
      Модель: "K953X",
      "Тип соединения": "проводная",
      Интерфейс: "USB",
      "Длина кабеля": "1.5 м",
      "Тип механических переключателей": "GTMX Brown",
      Механическая: "да",
      "Время отклика": "5 мс",
      Гарантия: "12 мес",
    },
    description: {
      description:
        "Клавиатура проводная Oklick K953X  – функциональная игровая модель со стильным корпусом. Клавиши дополнены многоцветной Rainbow-подсветкой. Благодаря полноразмерному исполнению на такой клавиатуре удобно играть, а также набирать текст или выполнять различные вычисления. Устройство Oklick K953X  оснащено 110 клавишами, среди которых имеется цифровой блок и  ряд Fn. Прибор подключается через кабель  1.2 м с USB-разъемом. Данная модель весит  623  г и обладает размерами  429 х  27 х  121 мм.",
    },
  },

  {
    type_equip: "keyboards",
    price: 6229,
    pathimg: "A4TECH_Bloody_S98",
    short_info: {
      "Тип соединения": "проводная",
      Интерфейс: "USB",
      "Длина кабеля": "1.8 м",
      "Тип механических переключателей": "BLMS Red Plus",
      Конструктив: "механическая",
    },
    main_info: {
      Бренд: "A4TECH",
      Модель: "Bloody S98",
      "Тип соединения": "проводная",
      Интерфейс: "USB",
      "Длина кабеля": "1.8 м",
      "Тип механических переключателей": "BLMS Red Plus",
      Механическая: "да",
      Гарантия: "12 мес",
    },
    description: {
      description:
        "Клавиатура A4TECH Bloody S98 Aviator отличается компактными размерами и поделена на две зоны. Несмотря на меньшее количество клавиш (в данной модели их  98 штук), она не уступает по функциональности полноразмерной клавиатуре. По умолчанию используются механические переключатели BLMS Red. При необходимости их можно заменить на другие — с тремя или пятью контактами. Специальные силиконовые накладки дополнительно снижают уровень шума. Скорость отклика составляет  1 мс, благодаря чему эта клавиатура подходит для профессионального гейминга. Также она подойдет для набора текста, потому что замыкание контактов происходит примерно в середине хода, а это исключает холостые нажатия.",
    },
  },

  {
    type_equip: "keyboards",
    price: 3939,
    pathimg: "DEFENDER_Striker_GK_380L",
    short_info: {
      "Тип соединения": "проводная",
      Интерфейс: "USB",
      "Длина кабеля": "1.8 м",
      "Тип механических переключателей": "Blue",
      Конструктив: "механическая",
    },
    main_info: {
      Бренд: "DEFENDER",
      Модель: "Striker GK-380L",
      "Тип соединения": "проводная",
      Интерфейс: "USB",
      "Длина кабеля": "1.8 м",
      "Тип механических переключателей": "Blue",
      Механическая: "да",
      Гарантия: "12 мес",
    },
    description: {
      description:
        "Клавиатура проводная Defender Striker GK-380L RU [45380] выполнена в компактном корпусе с  61 клавишей и соответствует форм-фактору TKL. Особенностью модели является радужная светодиодная подсветка с поддержкой  21 режима и регулировкой яркости. Механические кликающие переключатели обеспечивают высокую точность управления с характерным щелчком. Пластиковый корпус гарантирует стойкость устройства к повреждениям и жесткость конструкции. Подключение клавиатуры Defender Striker GK-380L RU осуществляется посредством USB-кабеля с износостойкой тканевой оплеткой.",
    },
  },

  {
    type_equip: "mouse",
    price: 3879,
    pathimg: "GMNG_980GMW",
    short_info: {
      Сенсор: "10000 dpi",
      "Количество кнопок": "7",
      Дизайн: "для правой руки",
      "Длина провода": "1.8 м",
      "Размеры (ДхШхВ)": "129.97 х  72.66 х  43.29 мм",
    },
    main_info: {
      Бренд: "GMNG",
      Модель: "980GMW",
      Технология: "оптическая",
      "Тип соединения мыши": "беспроводная",
      "Тип беспроводного соединения": "Радио",
      "Интерфейс подключения": "USB",
      "Длина провода": "1.8 м",
      Хват: "для правой руки",
      MTBF: "20000000 кликов",
      "Поддержка разрешений": "100/1600/3200/5000/10000 dpi",
      Гарантия: "12 мес",
    },
    description: {
      description:
        "Игровая беспроводная программируемая компьютерная мышь с док станцией. Высококачественные материалы. Чип и сенсор поддерживающие до  10  000 dpi в беспроводном режиме. Мышь разработана под правую руку. Боковые силиконовые вставки обеспечивают надежное и удобное удержание мыши. Док станция поддерживает не только зарядку станции но и выполняет другие функции – в док станцию вынесен usb ресивер, что обеспечивает минимальное расстояние до мышки. А это в свою очередь гарантирует стабильность работы и отсутствие потерь в передаче данных (сигнала). Индикатор док станции текущий уровень dpi включенного на мышке. Подсветка и на мышке и на док станции делает использование этого комплекта еще более приятным. Мышь программируется с помощью специального драйвера (на сайте производителя). Программное обеспечение (ПО) позволяет настраивать разрешение с шагом  100 dpi. ПО позволяет переназначать любые клавиши мышки, назначать любые макросы и настроить RGB подсветку под свои предпочтения. Встроенный Li-Ion аккумулятор обеспечивает до  40 часов активного использования мышки. Более того – мышь может работать в проводном режиме и вы не окажетесь в безвыходной ситуации если забыли зарядить аккумулятор. Плетеный зарядный кабель в комплекте (USB type C), позолоченный USB коннектор – все компоненты обеспечивают максимальную надежность, работоспособность и удобство использования мышки.",
    },
  },

  {
    type_equip: "mouse",
    price: 899,
    pathimg: "ACER_OMW121",
    short_info: {
      Сенсор: "6400 dpi",
      "Количество кнопок": "6",
      Дизайн: "для правой и левой руки",
      "Длина провода": "1.8 м",
      "Размеры (ДхШхВ)": "122 х  91 х  41 мм",
    },
    main_info: {
      Бренд: "ACER",
      Модель: "OMW121",
      Технология: "оптическая",
      "Тип соединения мыши": "проводная",
      "Интерфейс подключения": "USB",
      "Длина провода": "1.8 м",
      Хват: "для правой и левой руки",
      MTBF: "10000000 кликов",
      "Поддержка разрешений": "800/1600/2400/3200/4800/6400 dpi",
      Гарантия: "12 мес",
    },
    description: {
      description:
        "Мышь проводная Acer OMW121 представляет собой удобный в использовании и легкий компьютерный манипулятор, который обеспечит комфортные условия для многочасовой работы за компьютером дома или в офисе. Устройство, функционирующее на базе оптического светодиодного сенсора, подойдет и для прохождения игр благодаря разрешению датчика, достигающему  6400 dpi и гарантирующему молниеносное перемещение курсора и мгновенный отклик на команды пользователя. Лаконичный черный цвет корпуса с ненавязчивой RGB-подсветкой делает модель подходящей для дома или офиса. В оснащение проводной мыши Acer OMW121 входит шесть кнопок, включая кнопки выбора режима датчика из шести вариантов (800,  1600,  2400,  3200,  4800 и  6400 dpi). Устройство облачено в легкий и прочный корпус из пластика с покрытием SoftTouch, обеспечивающим надежный хват без риска выскальзывания и приятным на ощупь. Стабильную связь с компьютером без единого намека на прерывание сигнала гарантирует проводное подключение по  1.8-метровому кабелю с интерфейсом USB.",
    },
  },

  {
    type_equip: "mouse",
    price: 1819,
    pathimg: "A4TECH_P90s",
    short_info: {
      Сенсор: "8000 dpi",
      "Количество кнопок": "6",
      Дизайн: "для правой руки",
      "Длина провода": "1.8 м",
      Размеры: "126 х  67 х  43 мм",
    },
    main_info: {
      Бренд: "A4TECH",
      Модель: "P90s",
      Технология: "оптическая",
      "Тип соединения мыши": "проводная",
      "Интерфейс подключения": "USB",
      "Длина провода": "1.8 м",
      Хват: "для правой руки",
      MTBF: "20000000 кликов",
      "Поддержка разрешений": "100-8000 dpi",
      Гарантия: "12 мес",
    },
    description: {
      description:
        "Мышь проводная A4Tech Bloody P90s реагирует со скоростью отклика в  1 мс для точного и моментального позиционирования курсора в игре. Модель поддерживает регулировку разрешения датчика в диапазоне  100-8000 dpi, благодаря чему работу манипулятора можно настроить под требования любого экрана. Классический черный цвет корпуса дополняет RGB-подсветка, которая настраивается для создания уникального дизайна. Прорезиненное колесо прокрутки порадует долговечностью и приятными ощущениями при касании. Форма корпуса мыши A4Tech Bloody P90s оптимизирована для управления правой рукой.",
    },
  },

  {
    type_equip: "monitors",
    price: 24790,
    pathimg: "XIAOMI_Curved_Gaming_Monitor",
    short_info: {
      "Разрешение экрана": "2560x1080",
      "Частота обновления": "200 Гц",
      "Тип матрицы": "VA",
      "Соотношение сторон экрана": "21:09",
      "Тип блокапитания": "внешний",
    },
    main_info: {
      Бренд: "XIAOMI",
      Модель: "Curved Gaming Monitor",
      "Размер экрана": "30",
      "Разрешение экрана": "2560x1080",
      "Частота обновления": "200 Гц",
      "Соотношение сторон экрана": "21:09",
      "Тип матрицы": "VA",
      "Углы обзора": "178° по горизонтали,  178° по вертикали",
      "Тип блокапитания": "внешний",
      Энергопотребление: "48 Вт",
      "Количество разъемов HDMI": "2",
      "Версия разъемов HDMI": "1.4/2.1",
      "Количество разъемов DisplayPort": "1 шт",
      "Версия разъемов DisplayPort": "1.2",
    },
    description: {
      description:
        "Монитор Xiaomi Mi Curved Gaming Monitor  34 – безупречная по всем параметрам игровая модель, ставшая обладательницей изогнутого  34-дюймового экрана. Технология изготовления матрицы VA в сочетании с разрешающей способностью  3440x1440 пикселей гарантирует любому пользователю удовольствие от просмотра разнообразного контента. Картинка порадует красочностью и четкостью, а частота обновления  144 Гц и время отклика  4 мс способствуют плавному воспроизведению видеоряда. Благодаря поддержке технологии защиты глаз и матовому покрытию экрана снижается нагрузка на глаза. Геймерский монитор Xiaomi Mi Curved Gaming Monitor  34 располагает двумя портами DisplayPort и двуми видеоразъемами HDMI для возможности подключения к компьютеру. В устройстве также предусмотрен аудиоразъем, позволяющий напрямую к нему подключить наушники. Модель получила в свое оснащение эргономичную подставку, при помощи которой вы сможете настроить высоту монитора, угол его наклона и повернуть влево или вправо. При необходимости устройство можно разместить на стене, приобретая кронштейн с поддержкой размера VESA  100x100.",
    },
  },

  {
    type_equip: "monitors",
    price: 34270,
    pathimg: "ACER_XV272UVbmiiprzx",
    short_info: {
      "Разрешение экрана": "2560x1440",
      "Частота обновления": "170 Гц",
      "Тип матрицы": "IPS",
      "Соотношение сторон экрана": "16:9",
      "Тип блокапитания": "внутренний",
    },
    main_info: {
      Бренд: "ACER",
      Модель: "XV272UVbmiiprzx",
      "Размер экрана": "27",
      "Разрешение экрана": "2560x1440",
      "Частота обновления": "170 Гц",
      "Соотношение сторон экрана": "16:9",
      "Тип матрицы": "IPS",
      "Углы обзора": "178° по горизонтали,  178° по вертикали",
      "Тип блокапитания": "внутренний",
      Энергопотребление: "38 Вт",
      "Количество разъемов HDMI": "2",
      "Версия разъемов HDMI": "1.4",
      "Количество разъемов DisplayPort": "1 шт",
      "Версия разъемов DisplayPort": "1.4",
    },
    description: {
      description:
        "Монитор Acer Nitro XV272UKVbmiiprzx сочетает безрамочный дизайн, технологичность и функциональность. Модель благодаря применению ряда характеристик оптимизирована для поклонников компьютерных игр. На экране диагональю  27 дюймов стандарта QHD с матрицей IPS отображается реалистичная картинка с насыщенными и яркими цветами. Плавный геймплей без размытия кадра достигается за счет частоты обновления  170 Гц и времени отклика на уровне значения  1 мс. Acer Nitro XV272UKVbmiiprzx оборудован двумя видеовыходами HDMI, разъемом DisplayPort,  4 портами USB, а также выходом под наушники. Интегрированная аудиосистема с двумя динамиками по  2 Вт воспроизводит четкий насыщенный звук. А эргономичная конструкция подставки с разными вариантами настройки позволяет с гибкостью выбирать необходимое положение экрана.",
    },
  },

  {
    type_equip: "monitors",
    price: 39990,
    pathimg: "LG_34WP65C_B",
    short_info: {
      "Разрешение экрана": "3440x1440",
      "Частота обновления": "160 Гц",
      "Тип матрицы": "VA",
      "Соотношение сторон экрана": "21:9",
      "Тип блокапитания": "внешний",
    },
    main_info: {
      Бренд: "LG",
      Модель: "34WP65C-B",
      "Размер экрана": "34",
      "Разрешение экрана": "3440x1440",
      "Частота обновления": "160 Гц",
      "Соотношение сторон экрана": "21:9",
      "Тип матрицы": "VA",
      "Углы обзора": "178° по горизонтали,  178° по вертикали",
      "Тип блокапитания": "внешний",
      Энергопотребление: "45 Вт",
      "Количество разъемов HDMI": "2",
      "Версия разъемов HDMI": "2.0",
      "Количество разъемов DisplayPort": "1 шт",
      "Версия разъемов DisplayPort": "1.4",
    },
    description: {
      description:
        "LG UltraWide  34WP65C-B — монитор для геймеров с изогнутым экраном, тонким корпусом, возможностью регулировки положения и широким набором настроек для погружения в мир гейминга и мультимедиа. Сертифицированные технологии защиты зрения снижают нагрузку на глаза даже при длительной работе за экраном. Подсветка без мерцания Flicker-Free минимизирует неприятные блики, позволяя играть без напряжения глаз даже в полной темноте.",
    },
  },
];
export default equipments;
